Updated the readme file
